---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.SolidExtrusion
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.SolidExtrusion

Creates a 3D solid by extruding a 2D shape (profile).